update docs and examples
